# x = float(input())
# print(round(x%1, 2))
a = input()
b = a.split('.')
print('0.', b[1], sep = '')

# Дано положительное действительное число X. Выведите его дробную часть.