a = list(map(int, input().split()))
print(' '.join(map(str, a[::-1])))

# Выведите элементы данного списка в обратном порядке, не изменяя сам список.
