a = 'hello world by'.count(' ')
if a>=1:
    print(a+1)
else:
    print(1)

# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов.