a = '1+1=2'
print(a.replace('1','one'))

# Дана строка. Замените в этой строке все цифры 1 на слово one.