import math


def IsPrime(a):
    b = math.sqrt(a)
    if a == 2:
        return('Ne prostoe')
    for i in range(2, round(b)+1):
        if a % i == 0:
            return 'Ne prostoe'
    return 'Prostoe'


n = int(input())
print(IsPrime(n))


# Дано натуральное число n>1. Проверьте, является ли оно простым.
# Программа должна вывести слово YES, если число простое и NO,
# если число составное. Решение оформите в виде функции IsPrime(n),
# которая возвращает True для простых чисел и False для составных чисел.
# Программа должна иметь сложность O(корень из n): количество действий в программе должно быть пропорционально
# квадратному корню из n (иначе говоря, при увеличении входного числа в k раз,
# время выполнения программы должно увеличиваться примерно в корень из k раз).