a = '@mail@hse@ru'
print(a.replace('@',''))


# Дана строка. Удалите из этой строки все символы @.