mySet1 = set(map(int, input().split()))
mySet2 = set(map(int, input().split()))
print(sorted(mySet1 & mySet2))

# Даны два списка чисел, которые могут содержать до 10000 чисел каждый.
# Выведите все числа, которые входят как в первый, так и во второй список, в порядке возрастания.
# Вводятся два списка целых чисел. Все числа каждого списка находятся на отдельной строке.
# Эту задачу на Питоне можно решить в одну строчку.
